
#----------------


###############################################################
#   WECO_Set.R 파일 전체 선택 (Ctrl+A) 후 실행 (Ctrl+Enter)   #
# Work Directory에서 분석할 파일(전처리 완료된 csv 파일) 선택 #
###############################################################
SensorData <- read.csv('2019-04-10~ 2019-04-11(TCU).csv') 

###############################################################
#   WECO_A 먼저 실행 후 필요에 따라 WECO_T 또는 WECO_P 실행   #
###############################################################

WECO_A() #테이블 파일(호기, 데이터 위치, 시간, 값) 저장 

WECO_T() #Rule out 구간(시간) 저장

WECO_P() #그래프 저장

